{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-tim",
    "1": "I-tim",
    "2": "I-nat",
    "3": "B-eve",
    "4": "I-geo",
    "5": "B-per",
    "6": "B-org",
    "7": "B-art",
    "8": "I-gpe",
    "9": "I-art",
    "10": "B-gpe",
    "11": "B-nat",
    "12": "I-org",
    "13": "B-geo",
    "14": "I-eve",
    "15": "I-per",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-art": 7,
    "B-eve": 3,
    "B-geo": 13,
    "B-gpe": 10,
    "B-nat": 11,
    "B-org": 6,
    "B-per": 5,
    "B-tim": 0,
    "I-art": 9,
    "I-eve": 14,
    "I-geo": 4,
    "I-gpe": 8,
    "I-nat": 2,
    "I-org": 12,
    "I-per": 15,
    "I-tim": 1,
    "O": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
